In [1]:
import numpy as np
import pandas as pd

In [22]:
data = pd.read_csv('C:/Users/Dua/Desktop/data.csv')
data

       Date    Name   Age Course  Graduation  Education Gap in years
0  1/1/2019  Nabeel  20.0     AI      2009.0                       5
1  2/1/2019  Salman  14.0     AI      2016.0                       0
2  2/2/2019   Uzaif  22.0     AI      2017.0                       0
3  2/3/2019  Sameer   NaN    NaN         NaN                       0
4  2/4/2019  Raheel   NaN     AI         NaN                       0
5  2/5/2019  Khizer  45.0     AI      2019.0                       0
6  2/6/2019   Zafar  25.0     AI         NaN                       0

In [23]:
np.dtype(data['Date'])

dtype('O')

In [24]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [25]:
data['Age'].mean()

25.2

# Discretization and Binnig

In [26]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [27]:
bins = [18, 25, 35, 60, 100]

In [28]:
cats = pd.cut(ages, bins)

In [29]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [31]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [32]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [33]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [34]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [36]:
data = np.random.rand(1000)

In [37]:
cats = pd.qcut(data, 4) # Cut into quartiles or percentile
cats

[(0.497, 0.752], (0.752, 1.0], (0.243, 0.497], (0.752, 1.0], (0.752, 1.0], ..., (0.752, 1.0], (0.752, 1.0], (7.999999999999999e-05, 0.243], (0.243, 0.497], (0.752, 1.0]]
Length: 1000
Categories (4, interval[float64]): [(7.999999999999999e-05, 0.243] < (0.243, 0.497] < (0.497, 0.752] < (0.752, 1.0]]

In [38]:
pd.value_counts(cats)

(0.752, 1.0]                      250
(0.497, 0.752]                    250
(0.243, 0.497]                    250
(7.999999999999999e-05, 0.243]    250
dtype: int64

In [39]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.497, 0.892], (0.892, 1.0], (0.0836, 0.497], (0.497, 0.892], (0.892, 1.0], ..., (0.497, 0.892], (0.497, 0.892], (0.0836, 0.497], (0.0836, 0.497], (0.497, 0.892]]
Length: 1000
Categories (4, interval[float64]): [(7.999999999999999e-05, 0.0836] < (0.0836, 0.497] < (0.497, 0.892] < (0.892, 1.0]]

# Detecting and Filtering Outliers

In [40]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022707     0.062240     0.001910    -0.006867
std       0.959049     1.006030     1.016515     0.986345
min      -2.809476    -3.130968    -3.029969    -2.853957
25%      -0.584008    -0.596253    -0.650684    -0.675000
50%       0.037989     0.084123     0.009056    -0.041799
75%       0.634838     0.723940     0.684633     0.673059
max       4.254755     3.020929     3.254833     2.930023

In [41]:
col = data[2]

In [42]:
col[np.abs(col) > 3]

386   -3.029969
833   -3.020102
842    3.039766
999    3.254833
Name: 2, dtype: float64

In [43]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
6    0.143312  3.020929  0.270571  0.793064
107  0.671277 -3.130968 -1.444505 -0.390439
386  0.232432 -0.227930 -3.029969  1.936638
431 -0.749896  3.010473  1.701954 -1.635886
567  0.802165  3.008855  1.639325  0.216602
629  4.254755 -0.017705  1.003823 -1.515816
737  3.256339  1.469437  0.027749  0.109833
833 -0.338706  1.207923 -3.020102  0.618893
842 -1.028569  0.274395  3.039766 -0.238898
999  1.849449  0.126925  3.254833 -0.212518

In [44]:
sampler = np.random.permutation(5)
sampler
# jahan pr b permutation a rha hai wahan pr koi na koi ordering base ho rhi hai

array([3, 4, 1, 2, 0])

In [45]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [46]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [47]:
df.sample(n=3) # isey number of values btate hain

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [48]:
choices = pd.Series([5, 7, -1, 6, 4]) 
draws = choices.sample(n=10, replace=True) # to chose randomly

In [49]:
draws

4    4
3    6
4    4
3    6
4    4
3    6
2   -1
4    4
1    7
1    7
dtype: int64

# Computing Indicator/Dummy Variables

In [50]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [51]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [52]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [53]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [54]:
movies = pd.read_csv('C:/Users/Dua/Desktop/movies.csv')
movies

                    Movies  Releasing year         Genere
0                    Joker            2019  Action, Drama
1              Black Widow            2020         Action
2      Guardian of galaxy             2019         Animie
3  The fate of the furious            2019         Action

In [56]:
m_dummies = pd.get_dummies(movies['Releasing year'])
m_dummies

   2019  2020
0     1     0
1     0     1
2     1     0
3     1     0

In [58]:
movies_with_m_dummies = movies.join(m_dummies)
movies_with_m_dummies

                    Movies  Releasing year         Genere  2019  2020
0                    Joker            2019  Action, Drama     1     0
1              Black Widow            2020         Action     0     1
2      Guardian of galaxy             2019         Animie     1     0
3  The fate of the furious            2019         Action     1     0